// Примитивные типы данных
// string - строки это любой текст или символ указанные в '' ""
// number - числовой тип указывается без ковычек пишутся только числа с точкой и без
// boolean - true - false - истину и ложь в математике (1, 0)
// null - ничего пустота false 0
// undefined - значение не определено
// NaN - числовой тип (НЕ ЧИСЛО)
// console.log() - позволяет вывести результат значения в консоль

// console.log('hello world!');
// console.log(5);
// console.log(true);
// console.log(false);
// console.log(null);
// console.log(undefined);
// переменные 
// глобальные 
// var - ключевое слово для создания переменной создает переменную с глобальной областью видимости 
// локальные 
// const - создает тип неизменяемой переменной которой нельзя менять значение и тип данных 
// let переменная с ограниченной областью видимости 

// оператор присвоения = 
// var firstName = 'Тимур'
// var age = 25
// var und = null;

// операцией склеивания строк - Конкатенация (+)

// console.log('меня зовут '+ firstName + ' мне ' + age + ' лет');

// console.log('2' + 2 * 2);
// console.log('2' ** 10);
// console.log(10 / 2);

// console.log('fg' - 3);

// математические операции 

// + - * / - операторы 
// + сложение
// - вычитание 
// * умножение 
// / деление
// % - отсаток от деления

// prompt() - выводит диалоговое окно для ввода информации от пользователя 
// alert() - выводит сообщение для пользователя
var yourName = prompt('введите имя')
alert('Привет ' + yourName)
var yourAge = prompt('Введите возраст')
alert('вам ' + yourAge + ' лет/года')
